==
<!-- $Id$ -->
==

p((<>[11](my_class). This is a Textile test.

h1. This is a first-level header.

(list1)#(#listid1) This is the first entry in my ordered list[1].
#(listclass2) This is the second.

# This should be the first entry in a new ordered list.
# And this should be the second.

* This is a single-item unordered list.

OK, "here is a link":http://www.livingtorah.org to my website.

"Here is a link":http://www.livingtorah.org, and "here's another":http://www.livingtorah.org.

Let's try aliases: "here":ltm is the ministry link, and "here":ltj is the journal.

And then "a normal link (Sun)":http://www.sun.com to Sun's website.

Here are the inline tests: We have a *strong* and an _emphasized,_ a **bold,** an __italics,__ a ++bigger,++ a --smaller,-- something -deleted,- something +inserted,+ some ^superscript,^ some ~subscript,~ a %{color: red}red span,% and @some code, including something like 2>&1.@  And here's some ==*escaped text*== just to see what happens.  Here's some ??cited text?? also.

What about _emphasized text with some *strong* text within it?_

*_And what about something right at the beginning of a line?_*  Hm, what about that?  This isn't a list item, is it?

And let's not forget that we should be able to _(emphasize things in parentheses without it trying to turn that into a style)._

p)>. This should be a paragraph, floated right and padded on the right by 1 em.

bq. This is a blockquote.
I am going to cut it into small lines
With their own line breaks.

clear.

dl. term:definition
block:not usually something like this,
and here's a line break to make things really interesting
term with spaces:the definition should be self-evident
finally:a last definition to see if it works

|This is a simple table.|
>|Here is a cell that
has a newline character in it.  Yikes.|
|I hope that this works.|

table(#table1). _|row 1, col 1|row 1, col 2|
|\2. row 2, cols 1-2|
|/2. rows 3-4, col 1|row 3, col 2|
|row 4, col 2|
|^. row 5, col 1|~. row5, col 2|

table(tbl1). (head)|_. column 1 |_.      column 2 |_>.     column 3 |
                   |   1        |        2        |(test).        3 |
                   |   4        |(#foo). 5        |               6 |
                   |   7        |        8        |(test#bar).    9 |

bc.. This is code
  Which you can see is a little bit
    indented and tells us that 2>1
      And that 1 & 2 < 4
    Do you think this will work?

  Look, more indented code!
    It's supposed to stop before the next escape block.

==
<p>This is supposed to be escaped text.  I should be able to do [1] in here with no problems, as well as other weird things.</p>

bq. Like this.

h3. Or this.
==

h3))>. This is a third-level header.

1. And this is just a paragraph that starts with a number, perhaps in an ill-advised attempt to begin a list?

h7. This is a mistake[42].

bq>.. And here is a lengthier piece that actually contains what we would think of as an extended block.

This is also covered as part of the previous extended block.

p. And this is a normal paragraph again.

fn1. This is my first footnote.

fn42. This is my forty-second.

p=. Written by Charles Sebold

[ltm (Living Torah Ministries)]http://www.livingtorah.org
[ltj]http://www.livingtorah.org/journal/

==
<!--
Local Variables:
mode: auto-fill
End:
-->
==
